examples/delta-wing-2p2o-local/input/case_template/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-05;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    
    minX // inlet
    {
        type            calculated;
        value           uniform 0;
    }
    maxX // outlet
    {
        type            calculated;
        value           uniform 0;
    }

    minY // right side
    {
        type            calculated;
        value           uniform 0;
    }
    maxY // left side
    {
        type            calculated;
        value           uniform 0;
    }
    minZ // bottom
    {
        type            calculated;
        value           uniform 0;
    }
    maxZ // top
    {
        type            calculated;
        value           uniform 0;
    }
    solid
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

}


// ************************************************************************* //
